import main_front from '../assist/Become-a-Front-End-Developer.png'
import frontEnd from '../assist/frontEnd.PNG'
import main_back from '../assist/Become_a_Backend_Developer.jpg'
import backEnd from '../assist/backEnd.PNG'
import main_uix from '../assist/Become a UIX.jpg'
import uix from '../assist/uix.PNG'
import main_data from '../assist/Become Data Analysis.jpg'
import data from '../assist/Result (11).PNG'
const DataCourse = [
    {

        name: "Front-End Development", img: main_front, more_img: frontEnd,
        glanse: " مسار فرونت إند(Front- End) هو مجموعة المهارات والأدوات التي تستخدم لتصميم وتطوير واجهات المستخدم(UI) لتطبيقات الويب والمواقع، ويعد مسار فرونت إند جزءًا هامًا من عملية تطوير التطبيقات والمواقع الحديثة، حيث يتم تطبيقه على جانب العميل(Client - Side) لتحقيق تفاعلية أفضل وتجربة مستخدم أفضل، ويتطلب المسار معرفة بالأحدث في تقنيات الويب والمهارات المتقدمة في تصميم الواجهات وتطويرها. ",
        info: " المسار الكامل باذن الله لإحتراف مجال ال Front-End Development بكل ما يحتويه المسار من دورات تعليمية وأدوات ونصائح ومواقع ومراجع تفيدك أثناء رحلة التعلم, إستعد للإبحار في رحلة التعلم ",
        skills: ["html", 'css', 'javaScript'],
        coach: "هبة سلامة", duration: "60", cost: "80$",
    }
    ,
    {

        name: "Back-End Development", img: main_back, more_img: backEnd,
        glanse: " الواجهة الخلفية (Backend) هي جانب الخادم (Server Side) للموقع. تقوم بتخزين البيانات وترتيبها، وتتأكد أيضًا من أن كل شيء على جانب العميل (Client Side) من موقع الويب يعمل بشكل جيد. إنها جزء من موقع الويب لا يمكنك رؤيته والتفاعل معه. هذا هو الجزء من البرمجيات الذي لا يكون على اتصال مباشر مع المستخدمين.",
        info: "المسار المميز للـ back end develoer أو مبرمج المواقع , سكون هذا المسار مناسب لكل شخص مبتدئ في هذا المجال . ومزود بجميع الدورات التي توصلك للاحتراف .",
        skills: ['html', 'javaScript', 'php'],
        coach: "غيث الأحمد", duration: "70", cost: "100$",
    },
    {

        name: "UX/UI Designer", img: main_uix, more_img: uix,
        glanse: " UI/UX (Front-end) Developer - مطور واجهة المستخدم / واجهة البرنامج (واجهة أمامية) يتضمن تطوير الواجهات الأمامية للويب العديد من التقنيات المختلفة حيث يتغير المشهد باستمرار. إن تطوير الواجهات الأمامية للويب هو عبارة عن أيّ شيء يمكن للمستخدمين عرضه والتفاعل معه على الويب.",
        info: "سنأخذك في هذا التخصص عبر رحلة شاملة نبدأ فيها من التعريف بأساسيات ومصطلحات تفاعل المستخدم وتجربة المستخدم وسيحتوي على الكثير من التطبيق العملي ",
        skills: ['figma'],
        coach: "هبة سلامة", duration: "30", cost: "55$",
    },
    {

        name: "Data Analysis", img: main_data, more_img: data,
        glanse: "تحليل البيانات هو علم فحص البيانات لاستكمال المعلومات لاتخاذ القرارات أو توسيع المعرفة حول مواضيع مختلفة. يتكون من إخضاع البيانات للعمليات. تحدث هذه العملية للحصول على استنتاجات دقيقة لمساعدتنا في تحقيق أهدافنا ، مثل العمليات التي لا يمكن تحديدها مسبقًا لأن جمع البيانات قد يكشف عن صعوبات معينة.",
        info: "تتنوع هذه المهارات بين الإحصاء، و التنقيب عن البيانات، والتعلم الآلي، والنمذجة التنبؤية، وذكاء الأعمال. بعد الانتهاء من هذه الدورة، يصبح الخريج قادرًا على المنافسة في سوق التحليلات لصالح مُحللي البيانات ومُحللي ذكاء الأعمال، سواء في السوق المحلية أو حتى في السوق العالمية من خلال العمل الحر والعمل عن بُعد.",
        skills: ['python'],
        coach: "تيم اليوسف", duration: "56", cost: "101$",
    },
]


export default DataCourse